app/rpc/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def get_product
    product = Product.find(request.message.id.to_i)

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "S10 Plus"], ["price", 11110.0], ["created_at", "2020-03-31 09:03:01.550867"], ["updated_at", "2020-03-31 09:03:01.550867"]]
---
  def create_products
    products = []
    request.messages do |message|
      products << Product.create(name: message.name, price: message.price).to_proto